[{"term":"IPV6 comprimento","definition":"128 bits = 32 dígitos hexadecimais"},{"term":"IPV4 comprimento","definition":"2^32 = 4294967296 \nendereços = 32 bits"},{"term":"TIPO IPV6","definition":"Unicast anycast multicast"},{"term":"Exemplo IPV6","definition":"FFDC 4738 D423 8800 0000 57AB BC99 3200"},{"term":"UNICAST","definition":"Por identificar unicamente uma interface de rede"},{"term":"MULTICAST","definition":"um endereço IP que designa um grupo de interfaces"},{"term":"ANYCAST","definition":"utilizado para identificar um grupo de interfaces,  o pacote destinado à um endereço Anycast é entregue somente à interface\nmais próxima da origem, enquanto o Multicast entrega a todos os participantes do grupo."},{"term":"Cabeçalho IPV6","definition":"introduz um novo formato de cabeçalho = novo cabeçalho possuem tamanho fixo, totalizando 64 bytes = celera bastante o processamento dos pacotes pelos\nroteadores"},{"term":"Flow Label","definition":"identificar fluxos de pacotes que requerem tratamento\nespecial (IPV6)"},{"term":"Hop Limit (8 bits)","definition":"Número máximo de saltos que o pacote pode fazer (similar ao TTL no\nIPv4)"},{"term":"ARP","definition":"(Address Resolution Protocol), cujo o objetivo é mapear os endereços físicos através\ndos endereços lógicos;"},{"term":"RARP","definition":"REVERSE ADDRES RESOLUTION PROTOCOL = realiza o inverso do ARP"},{"term":"IGMP","definition":"Internet Group Management Protocol), que atua com o gerenciamento de\nmembros de grupos Multicast."},{"term":"MLD (Multicast Listener Discover","definition":"), que opera com o gerenciamento dos grupos Multicast;"},{"term":"Mobility suppor","definition":"que cuida do gerenciamento de endereços de origem dos hosts\ndinamicamente;"},{"term":"O Limite do IPv4:","definition":"ICMPv6 (Internet Control Message Protocol) é uma versão atualizada do protocolo ICMPv4 para ser\nutilizada em conjunto com o IPv6. Sua implementação, portanto, é obrigatória em todos os nós da\nrede que utilizam IPv6 para se comunicar."},{"term":"Comparação IPV4 e IPV6","definition":"O tamanho do endereço IPv6 é de 128 bits, enquanto o tamanho do endereço IPv4 é de\n32 bits."}]